% Q1
% (1) 已知平面上的直线 l 方程为： y = 2x + 3 ，试计算该直线关于直线 m 的镜像方程，已知 m 经过点 (3,2), (-5,0)。
clear all;
%直线m经过
M1=[3,2,1];
M2=[-5,0,1];
%取直线l经过的两点
L1=[0,3,1];
L2=[-1,1,1];
%变换
T1=[1 0 0;0 1 0;-M2(1) -M2(2) 1];
k_m=(M2(2)-M1(2))/(M2(1)-M1(1));
th=pi-atan(k_m);
T2=[cos(th) sin(th) 0; -sin(th) cos(th) 0; 0 0 1];
T3=[-1 0 0;0 1 0;0 0 1];
T4=inv(T2);
T5=inv(T1);
%直线l上取的两点变换之后新坐标
L1_new=L1*T1*T2*T3*T4*T5;
L2_new=L2*T1*T2*T3*T4*T5;
%新的k和b
k_l_new=(L2_new(2)-L1_new(2))/(L2_new(1)-L1_new(1));
b_l_new=L1_new(2)-k_l_new*L1_new(1);